
/******************** (C) COPYRIGHT  ***************************************
 * 文件名  ：timer1.c
 * 描述    ：UART1设置文件   

*******************************************************************************/

/* 包含系统头文件 */

#include "timer1.h"

/* 自定义新类型 */

/* 自定义宏 */

/* 全局变量定义 */

/*******************************************************************************
 * 名称: Tim1_Init
 * 功能: Timer1初始化操作
 ******************************************************************************/
void Tim1_Init(void)
{
  TIM1_DeInit();   
  TIM1_TimeBaseInit(16,TIM1_COUNTERMODE_UP,9999,100);//16分频，向上计数，计数完了触发中断，如果想
  //再 1MS 触发中断，则计数器应该计数 1000 次，1MHZ/1000=1KHZ，正好就是 1ms。
  TIM1_ClearFlag(TIM1_FLAG_UPDATE);
  TIM1_ARRPreloadConfig(ENABLE);//使能自动重装
  TIM1_ITConfig(TIM1_IT_UPDATE , ENABLE);//数据更新中断
  TIM1_Cmd(ENABLE);//开定时器
       
}



